brew "libpng"
brew "autoconf"
brew "automake"
brew "bison"
brew "bzip2"
brew "clang-format"
brew "openssl@3"
brew "curl"
brew "dos2unix"
brew "freetype"
brew "gettext"
brew "gd"
brew "libiconv"
brew "git"
brew "gmp"
brew "hidapi"
brew "icu4c@78"
brew "jpeg"
brew "krb5"
brew "libedit"
brew "libpq"
brew "libsodium"
brew "libusb"
brew "readline"
brew "libxml2"
brew "libzip"
brew "llvm"
brew "make"
brew "oniguruma"
brew "openssl@1.1"
brew "pkgconf"
brew "re2c"
brew "wget"
brew "zlib"
cask "ghostty"
vscode "anthropic.claude-code"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "crazyfluff.bettermaterialthemedarkerhighcontrast"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "endoumame.0x96f-material-theme"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "filipjane.0x96f-vscode-theme"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "hverlin.mise-vscode"
vscode "janisdd.vscode-edit-csv"
vscode "johnpapa.vscode-peacock"
vscode "junstyle.php-cs-fixer"
vscode "mhutchie.git-graph"
vscode "michael4d45.mago-vscode"
vscode "mikestead.dotenv"
vscode "moonbit.moonbit-lang"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-speech-language-pack-ja-jp"
vscode "ms-vscode.vscode-typescript-next"
vscode "pkief.material-icon-theme"
vscode "recca0120.vscode-phpunit"
vscode "redhat.vscode-yaml"
vscode "sanderronde.phpstan-vscode"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
vscode "yusukehirao.vscode-markuplint"
vscode "yzhang.markdown-all-in-one"
go "cmd/go"
go "cmd/gofmt"
uv "qmk", with: ["pip"]
